<template>
    <div class="messageBox">
        <div class="messageTitle">
            <span>消息</span>
        </div>
        <div class="menuWrap">
            <el-tabs v-model="activePos" @tab-click="handleClick">
                <template v-for="(item,index) in tabs">
                    <el-tab-pane :key="index" :name="item.id">
                        <span slot="label">
                            <el-badge :is-dot="item.isDot" class="item">
                                <span>{{item.name}}</span>
                            </el-badge>
                        </span>
                    </el-tab-pane>
                </template>
            </el-tabs>
        </div>
        <div class="contentWrap">
            <div class="leftList">
                <el-scrollbar class="el_content" ref="scrollContent">
                    <div class="listItem" v-for="(item,index) in 20" :key="index">
                        <div class="text">
                            <div class="title">
                                <span>【系统消息】4月16日凌晨数据库升级</span>
                            </div>
                            <div class="dateTime">
                                <span>2020-08-09 20:00:00</span>
                            </div>
                        </div>
                        <div class="status">
                            <span>已读</span>
                        </div>
                    </div>
                </el-scrollbar>
            </div>
            <div class="rightContent">
                <div class="titleWrap">
                    <span class="title">【系统消息】4月16日凌晨数据库升级</span>
                    <span class="dateTime">2020-05-12 18:44:52</span>
                </div>
                <el-scrollbar class="el_content" ref="scrollContent">
                    <div class="contentText">
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>

                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                        <span>4月16日凌晨数据库升级系统停用通知：尊敬的用户，本系统将于2020年4月16日（本周四）凌晨03:00-05:00对服务器进行升级，升级期间系统将停用，请各商户合理安排好营业时间，给您造成不便，敬请谅解，谢谢。</span>
                    </div>
                </el-scrollbar>
            </div>
        </div>
    </div>
</template>

<style lang="scss" scope>
@import './message.scss';
</style>
<script src="./message.js"></script>